
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1.为何写博客 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2015-03-17-adb常用命令学习记录.html" />
    
    
    <link rel="prev" href="2016-09-27-android应用自动化测试.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    thearyong
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    

    
        
        <li class="header">2017</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="../2017/2017-12-10-语音方案预研.html">
            
                <a href="../2017/2017-12-10-语音方案预研.html">
            
                    
                    1.语音方案预研
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">2016</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="../2016/2016-04-16-Android编码实用小技巧整理.html">
            
                <a href="../2016/2016-04-16-Android编码实用小技巧整理.html">
            
                    
                    1.Android编码实用小技巧整理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="22016-08-05-QQ6.5.0逆向笔记.md">
            
                <span>
            
                    
                    2.QQ6.5.0逆向笔记
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="2016-09-27-android应用自动化测试.html">
            
                <a href="2016-09-27-android应用自动化测试.html">
            
                    
                    3.android应用自动化测试
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">2015</li>
        
        
    
        <li class="chapter active" data-level="5.1" data-path="2015-01-02-为何写博客.html">
            
                <a href="2015-01-02-为何写博客.html">
            
                    
                    1.为何写博客
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="2015-03-17-adb常用命令学习记录.html">
            
                <a href="2015-03-17-adb常用命令学习记录.html">
            
                    
                    2.adb常用命令学习记录
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.3" data-path="2015-08-15-Android自定义dialog显示问题.html">
            
                <a href="2015-08-15-Android自定义dialog显示问题.html">
            
                    
                    3.Android自定义dialog显示问题
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.4" data-path="2015-10-21-git常用命令学习记录.html">
            
                <a href="2015-10-21-git常用命令学习记录.html">
            
                    
                    4.git常用命令学习记录
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    

    
        
        <li class="header">网站信息</li>
        
        
    
        <li class="chapter " data-level="7.1" >
            
                <a target="_blank" href="https://beian.miit.gov.cn">
            
                    
                    粤ICP备16077052号
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >1.为何写博客</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>&#x4ECE;&#x7B2C;&#x4E00;&#x4E2A;&#x6B63;&#x5F0F;&#x535A;&#x5BA2;&#xFF0C;&#x81F3;&#x4ECA;&#x6709;4&#x5E74;&#x4E86;&#x3002;&#x5185;&#x5BB9;&#x8F93;&#x51FA;&#x4E0D;&#x591A;&#xFF0C;&#x603B;&#x7ED3;&#x53D9;&#x4E8B;&#x80FD;&#x529B;&#x5DEE;&#xFF0C;&#x6587;&#x7B14;&#x70C2;&#xFF0C;&#x6B20;&#x7CBE;&#x534E;&#xFF1B;&#x53C8;&#x65AD;&#x66F4;&#xFF0C;&#x8010;&#x5FC3;&#x575A;&#x6301;&#x8FD8;&#x662F;&#x6709;&#x5F85;&#x78E8;&#x70BC;&#xFF01;&#x5F88;&#x662F;&#x6127;&#x5BF9;&#x6BD5;&#x4E1A;&#x65F6;&#x70ED;&#x60C5;&#x9AD8;&#x6DA8;&#x7684;&#x81EA;&#x5DF1;&#xFF1A;<strong>&#x4E0D;&#x5FD8;&#x521D;&#x5FC3;</strong>&#x3002;
&#x95F2;&#x6687;&#x4E4B;&#x4F59;&#x60F3;&#x60F3;&#xFF0C;&#x4E3A;&#x4F55;&#x5199;&#x535A;&#x5BA2;&#xFF0C;&#x4E3A;&#x4F55;&#x65AD;&#x66F4;&#xFF0C;&#x53C8;&#x4E3A;&#x4F55;&#x62FE;&#x8D77;&#x6765;&#x2026;&#x2026;</p>
<!-- more -->
<h2 id="&#x5F00;&#x535A;&#x7ECF;&#x5386;">&#x5F00;&#x535A;&#x7ECF;&#x5386;</h2>
<h3 id="20127-20143-oschinanet">[2012/7-2014/3] <a href="http://my.oschina.net/blackylin/blog" target="_blank">oschina.net</a></h3>
<p>2012&#x5E74;7&#x6708;&#xFF0C;&#x521A;&#x6BD5;&#x4E1A;&#x8BD5;&#x7528;&#x671F;&#xFF0C;&#x7B2C;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#xFF0C;&#x5E74;&#x8F7B;&#x52A8;&#x529B;&#x8DB3;&#xFF0C;&#x60F3;&#x4EC0;&#x4E48;&#x90FD;&#x505A;&#x7684;&#x6BD4;&#x4EBA;&#x597D;&#xFF0C;&#x8BF7;&#x6559;&#x8001;&#x5927;&#x4EEC;&#x901F;&#x6210;&#x4E4B;&#x6CD5;&#xFF1A;&#x591A;&#x505A;&#x3001;&#x591A;&#x8BB0;&#x5F55;&#x3001;&#x591A;&#x5B66;&#x4E60;&#x3002;&#x4E8E;&#x662F;&#x767D;&#x5929;&#x5162;&#x5162;&#x4E1A;&#x4E1A;&#x5DE5;&#x4F5C;&#x5B66;&#x4E60;&#xFF0C;&#x665A;&#x4E0A;&#x4E0B;&#x73ED;&#x665A;1-2&#x4E2A;&#x5C0F;&#x65F6;&#x603B;&#x7ED3;&#x4E00;&#x5929;&#x6240;&#x7528;&#x6240;&#x5F97;&#xFF0C;&#x5728;oschina&#x4E0A;&#x5F00;&#x4E86;&#x7B2C;&#x4E00;&#x4E2A;&#x535A;&#x5BA2;&#x3002;</p>
<blockquote>
<p><strong>&#x4E3A;&#x5565;&#x6CA1;&#x5728;csdn&#x4E0A;&#x5F00;&#xFF1F;</strong></p>
</blockquote>
<p>&#x867D;&#x7136;&#x597D;&#x591A;&#x5927;&#x725B;&#x90FD;&#x662F;&#x5728;&#x8FD9;&#x4E0A;&#x9762;&#x5F00;&#x535A;&#xFF0C;&#x4E5F;&#x6709;&#x8FC7;&#x597D;&#x51E0;&#x4E2A;&#x8D26;&#x53F7;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x559C;&#x90A3;&#x6392;&#x7248;&#xFF0C;&#x5E7F;&#x544A;&#xFF0C;&#x751A;&#x8005;&#x8BBA;&#x575B;&#x91CC;&#x7ECF;&#x5E38;&#x6709;&#x5934;&#x6CA1;&#x5C3E;&#x7684;&#x68AF;&#x5B50;&#xFF0C;&#x8BA9;&#x6211;&#x907F;&#x800C;&#x8FDC;&#x4E4B;&#xFF01;&#x4E8E;&#x662F;&#x70ED;&#x8877;&#x8FD9;&#x4E2A;&#x7CBE;&#x7B80;&#x5F00;&#x6E90;&#x7684;&#x5E73;&#x53F0;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x91CC;&#x7684;&#x63D0;&#x95EE;&#x548C;stackoverflow&#x5F62;&#x5F0F;&#x5DEE;&#x4E0D;&#x591A;&#xFF0C;&#x8BF7;&#x539F;&#x8C05;&#x6211;&#x82F1;&#x8BED;&#x4E0D;&#x597D;&#x3002;&#x4F46;&#x8FD8;&#x662F;&#x63A8;&#x8350;&#x5728;stackoverflow&#x4E0A;&#x627E;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x6BD5;&#x7ADF;&#x5168;&#x4E16;&#x754C;&#x5927;&#x591A;&#x6570;&#x7A0B;&#x5E8F;&#x5458;&#x9047;&#x5230;&#x7684;&#x95EE;&#x9898;&#x90FD;&#x835F;&#x805A;&#x4E8E;&#x6B64;&#x3002;</p>
<p>&#x9AD8;&#x6DA8;&#x7684;&#x70ED;&#x60C5;&#x6301;&#x7EED;&#x6CA1;&#x591A;&#x4E45;&#xFF0C;&#x540E;&#x9762;&#x5C31;&#x65AD;&#x65AD;&#x7EED;&#x7EED;&#x3002;&#x76F4;&#x5230;&#x7B2C;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#x7ED3;&#x675F;&#xFF0C;&#x535A;&#x5BA2;&#x4E5F;&#x505C;&#x66F4;&#x4E86;&#x3002;</p>
<h3 id="20159-2016-2-thearcn">[2015/9-2016-2] <a href="thear.cn">thear.cn</a></h3>
<p>&#x4F5C;&#x4E3A;&#x5199;&#x7A0B;&#x5E8F;&#x7684;&#x4E00;&#x4E2A;&#x5C0F;&#x4F19;&#x5B50;&#xFF0C;&#x80AF;&#x5B9A;&#x90FD;&#x60F3;&#x8FC7;&#x62E5;&#x6709;&#x81EA;&#x5DF1;&#x7AD9;&#x70B9;&#x3002;&#x4E4B;&#x524D;&#x6CA1;&#x5B9E;&#x65BD;&#xFF0C;&#x4E3B;&#x8981;&#x6709;2&#x70B9;&#xFF1A;</p>
<ul>
<li>&#x52A8;&#x624B;&#x80FD;&#x529B;&#x4E0D;&#x8DB3;</li>
<li>&#x535A;&#x5BA2;&#x5E73;&#x53F0;&#x6BD4;&#x4E2A;&#x4EBA;&#x4E13;&#x4E1A;</li>
</ul>
<p>&#x62FE;&#x8D77;&#x4EE5;&#x524D;&#x6000;&#x62B1;&#x7684;&#x68A6;&#x60F3;&#xFF0C;&#x4E8E;&#x662F;&#x5C31;&#x52A8;&#x624B;&#x6363;&#x9F13;&#x4E86;&#x4E2A;&#x5C0F;&#x7AD9;&#x70B9;&#xFF0C;&#x672C;&#x60F3;&#x81EA;&#x5DF1;&#x52A8;&#x624B;&#x5199;&#xFF0C;&#x987A;&#x4FBF;&#x5B66;&#x4E60;&#x4E0B;&#x524D;&#x7AEF;&#x548C;&#x540E;&#x53F0;&#x77E5;&#x8BC6;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x590D;&#x6742;&#x5EA6;&#x8FDC;&#x8FDC;&#x88AB;wp&#x7684;&#x7B80;&#x5355;&#x5FEB;&#x6377;&#x7ED9;pk&#x6389;&#x4E86;&#x3002;&#x6700;&#x7EC8;&#x5C31;&#x968F;&#x610F;&#x9009;&#x4E86;&#x4E2A;&#x7B80;&#x6D01;&#x70B9;&#x4E3B;&#x9898;&#xFF0C;&#x51D1;&#x5408;&#x7740;&#x7528;&#x5427;&#xFF0C;&#x53CD;&#x6B63;&#x53EA;&#x662F;&#x81EA;&#x5DF1;&#x7B80;&#x5355;&#x8BB0;&#x5F55;&#x800C;&#x5DF2;&#x3002;
&#x96BE;&#x582A;&#x7684;&#x662F;&#xFF0C;&#x534A;&#x5E74;&#x6765;&#x8FD8;&#x662F;&#x53EA;&#x6709;&#x51E0;&#x7BC7;&#x6742;&#x8D27;&#x800C;&#x5DF2;&#xFF01;&#x96BE;&#x4EE5;&#x50CF;mac&#x541B;&#x90A3;&#x6837;&#xFF0C;&#x4E45;&#x8015;&#x4E0D;&#x7F00;&#xFF0C;&#x6587;&#x7B14;&#x901A;&#x7545;&#xFF0C;&#x8BED;&#x8A00;&#x6B22;&#x5FEB;&#x8BD9;&#x8C10;&#xFF0C;&#x5B57;&#x91CC;&#x884C;&#x95F4;&#x90FD;&#x6CC4;&#x9732;&#x4EBA;&#x751F;&#x5927;&#x9053;&#x548C;&#x4EBA;&#x6587;&#x60C5;&#x6000;&#xFF01;&#x7EB5;&#x6A2A;&#x5F00;&#x9616;&#x6280;&#x672F;&#x4E0E;&#x5199;&#x4F5C;&#x4E4B;&#x95F4;&#xFF0C;&#x8FD9;&#x624D;&#x662F;&#x5927;&#x5BB6;&#x98CE;&#x8303;&#xFF01;</p>
<h3 id="20162-xxx-thearyongcom">[2016/2-xxx] <a href="thearyong.com">thearyong.com</a></h3>
<p>&#x6709;&#x6BB5;&#x65F6;&#x95F4;&#x5F88;&#x51B2;&#x52A8;&#xFF0C;&#x6BD4;&#x5973;&#x6027;&#x901B;&#x5929;&#x732B;&#x3001;&#x7F8E;&#x4E3D;&#x8BF4;&#x8FD8;&#x51B2;&#x52A8;&#x3002;&#x7A0B;&#x5E8F;&#x5458;&#x901B;&#x57DF;&#x540D;&#xFF0C;&#x4E00;&#x4E0D;&#x5C0F;&#x5FC3;&#xFF0C;&#x902E;&#x5230;&#x4E2A;&#x672A;&#x88AB;&#x6CE8;&#x518C;&#x7684;&#x57DF;&#x540D;&#xFF0C;&#x773C;&#x4E5F;&#x6CA1;&#x7728;&#x652F;&#x4ED8;&#x5B9D;&#x4E00;&#x5237;&#xFF0C;&#x8FD8;&#x662F;10&#x5E74;&#x3002;&#x540E;&#x9762;&#x88AB;&#x540C;&#x4E8B;&#x8BF4;&#x4E86;&#xFF0C;&#x5B66;&#x4E56;&#x4E86;&#xFF0C;&#x4E70;5&#x5E74;&#x7684;&#xFF01;&#x90A3;1&#x4E2A;&#x661F;&#x671F;&#x5C31;&#x4E70;&#x4E86;4&#x4E2A;&#x57DF;&#x540D;&#xFF0C;&#x53EF;&#x4EE5;&#x5241;&#x624B;&#x4E86;&#xFF01;&#xFF01;&#xFF01;</p>
<p>&#x4E8E;&#x662F;&#x5C31;&#x5E72;&#x8106;&#x7528;&#x8FD9;&#x4E2A;&#x57DF;&#x540D;&#x4F5C;&#x4E3A;&#x4E3B;&#x7AD9;&#x3002;</p>
<p>&#x65E0;&#x610F;&#x4E2D;&#x53D1;&#x73B0;&#xFF0C;&#x5F88;&#x591A;&#x535A;&#x5BA2;&#x5730;&#x5740;&#x662F;xxx.github.io&#xFF0C;&#x987A;&#x85E4;&#x6478;&#x74DC;&#xFF0C;&#x53D1;&#x73B0;&#x4E86;&#x65B0;&#x5927;&#x9646;&#x2014;&#x2014;<strong>GitHub Pages</strong>&#x3002;</p>
<p><strong>GitHub Pages&#x7279;&#x70B9;&#xFF1A;</strong></p>
<ul>
<li>&#x5168;&#x9759;&#x6001;&#x9875;&#x9762;</li>
<li>git&#x7248;&#x672C;&#x63A7;&#x5236;</li>
<li>&#x652F;&#x6301;markdown</li>
<li>diy&#x4E3B;&#x9898;</li>
<li>&#x7ED1;&#x5B9A;&#x57DF;&#x540D;</li>
<li>&#x514D;&#x8D39;&#x65E0;&#x9650;&#x6D41;&#x91CF;&#xFF0C;&#x514D;&#x8D39;&#x65E0;&#x9650;&#x6D41;&#x91CF;&#xFF0C;&#x514D;&#x8D39;&#x65E0;&#x9650;&#x6D41;&#x91CF;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x8BF4;3&#x904D;</li>
</ul>
<p>&#x5C31;&#x6700;&#x540E;&#x4E00;&#x70B9;&#xFF0C;&#x4E0D;&#x5C1D;&#x8BD5;&#x5979;&#xFF0C;&#x6709;&#x70B9;&#x5BF9;&#x4E0D;&#x8D77;&#x7A77;&#x903C;&#x7684;&#x81EA;&#x5DF1;&#xFF01;
&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x4E0D;&#x7D2F;&#x8FF0;&#x4E86;&#xFF0C;&#x7F51;&#x4E0A;&#x6709;&#x5F88;&#x591A;&#x8D85;&#x7EA7;&#x8BE6;&#x7EC6;&#x7684;&#x6559;&#x7A0B;&#x3002;&#x559C;&#x6B22;&#x6298;&#x817E;&#xFF0C;&#x8861;&#x91CF;&#x540E;&#x8FD8;&#x662F;&#x9009;&#x62E9;&#x5B98;&#x65B9;&#x63A8;&#x8350;&#x7684;&#x642D;&#x914D;&#xFF1A;
Git+GitHub+Jekyll+&#x9A6C;&#x514B;&#x98DE;&#x8C61;</p>
<p>================================================================================
ps:</p>
<ol>
<li>&#x540E;&#x6765;&#x53D1;&#x73B0;hexo&#xFF0C;&#x751F;&#x6210;&#x9759;&#x6001;&#x9875;&#x9762;&#x53EA;&#x8981;&#x51E0;&#x79D2;&#xFF0C;&#x4E3B;&#x9898;&#x4E5F;&#x4E30;&#x5BCC;&#xFF0C;&#x4E5F;&#x65B9;&#x4FBF;&#x4ECE;Jekyll&#x8FC1;&#x79FB;&#xFF01;</li>
<li>&#x4E4B;&#x524D;&#x4EE5;&#x4E3A;&#x9A6C;&#x514B;&#x98DE;&#x8C61;&#x53EF;&#x4EE5;&#x652F;&#x6301;&#x5916;&#x94FE;&#xFF0C;&#x5F00;&#x4E86;&#x4E2A;&#x4F1A;&#x5458;&#xFF0C;&#x60B2;&#x50AC;&#x53D1;&#x73B0;&#xFF0C;&#x7136;&#x5E76;&#x8F6F;&#xFF0C;&#x65E9;&#x77E5;&#x76F4;&#x63A5;&#x7528;&#x6709;&#x9053;&#x4E91;&#x7B14;&#x8BB0;&#xFF08;&#x5F53;&#x65F6;&#x4E5F;&#x51FA;&#x4E86;&#x4E2A;&#x6D4B;&#x8BD5;&#x7248;&#x652F;&#x6301;markdown&#x8BED;&#x6CD5;&#xFF0C;&#x4F46;&#x4E5F;&#x4E0D;&#x8D44;&#x74F7;&#x5916;&#x94FE;&#xFF09;&#x3002;&#x65E0;&#x5948;&#xFF0C;&#x53EA;&#x597D;&#x91CD;&#x65B0;&#x5BFB;&#x627E;&#x7F16;&#x8F91;&#x5668;&#xFF0C;atom&#x8FDB;&#x5165;&#x4E86;&#x89C6;&#x91CE;&#x3002;&#x8BD5;&#x4E0B;&#x6C34;&#xFF0C;&#x548C;sublime&#x4E00;&#x6837;&#xFF0C;sublime&#x6709;&#x7684;&#x5B83;&#x90FD;&#x6709;&#x3002;&#x652F;&#x6301;&#x63D2;&#x4EF6;diy&#xFF0C;&#x754C;&#x9762;&#x66F4;&#x7F8E;&#x89C2;&#xFF01;&#x66F4;&#x6B22;&#x559C;&#x7684;&#x662F;&#xFF0C;&#x6709;&#x63D2;&#x4EF6;&#x652F;&#x6301;&#x4E03;&#x725B;&#x56FE;&#x5E8A;&#xFF0C;&#x76F4;&#x63A5;&#x622A;&#x5C4F;&#xFF0C;cmd+v&#x7C98;&#x8D34;&#x5F97;&#x5230;&#x6211;&#x5916;&#x94FE;&#x56FE;&#x7247;&#xFF1B;&#x652F;&#x6301;markdown&#x9884;&#x89C8;&#x2026;&#x2026;</li>
<li>&#x5BB6;&#x91CC;&#x7F51;&#x7EDC;&#x662F;&#x957F;&#x57CE;&#x5BBD;&#x5E26;&#xFF0C;github&#x7ECF;&#x5E38;&#x6253;&#x4E0D;&#x5F00;&#xFF0C;&#x867D;&#x7136;&#x672A;&#x5899;&#xFF0C;&#x4F46;&#x8981;&#x4F7F;&#x7528;&#x4EE3;&#x7406;&#x624D;&#x80FD;&#x5B8C;&#x6574;&#x663E;&#x793A;&#x51FA;&#x6765;&#xFF0C;&#x6B32;&#x54ED;&#x65E0;&#x6CEA;&#xFF01;&#x6700;&#x540E;&#x8F6C;&#x79FB;&#x5230;&#x56FD;&#x5185;&#x7684;coding&#x5E73;&#x53F0;&#xFF01;
&#x6700;&#x7EC8;&#x642D;&#x914D;&#xFF1A;
Git+Coding&#xFF08;GitHub&#x53CC;&#x6258;&#x7BA1;&#xFF09;+Hexo+atom+&#x4E03;&#x725B;</li>
</ol>
<p>================================================================================</p>
<h2 id="&#x611F;&#x60F3;">&#x611F;&#x60F3;</h2>
<p><a href="http://www.ruanyifeng.com/blog/2012/08/blogging_with_jekyll.html" target="_blank">&#x5F15;&#x7528;&#x962E;&#x4E00;&#x5CF0;&#x7684;&#x4E00;&#x4E2A;&#x603B;&#x7ED3;:</a></p>
<p>&#x559C;&#x6B22;&#x5199;Blog&#x7684;&#x4EBA;&#xFF0C;&#x4F1A;&#x7ECF;&#x5386;&#x4E09;&#x4E2A;&#x9636;&#x6BB5;&#xFF1A;</p>
<blockquote>
<p>&#x7B2C;&#x4E00;&#x9636;&#x6BB5;&#xFF0C;&#x521A;&#x63A5;&#x89E6;Blog&#xFF0C;&#x89C9;&#x5F97;&#x5F88;&#x65B0;&#x9C9C;&#xFF0C;&#x8BD5;&#x7740;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x514D;&#x8D39;&#x7A7A;&#x95F4;&#x6765;&#x5199;&#x3002;
&#x7B2C;&#x4E8C;&#x9636;&#x6BB5;&#xFF0C;&#x53D1;&#x73B0;&#x514D;&#x8D39;&#x7A7A;&#x95F4;&#x9650;&#x5236;&#x592A;&#x591A;&#xFF0C;&#x5C31;&#x81EA;&#x5DF1;&#x8D2D;&#x4E70;&#x57DF;&#x540D;&#x548C;&#x7A7A;&#x95F4;&#xFF0C;&#x642D;&#x5EFA;&#x72EC;&#x7ACB;&#x535A;&#x5BA2;&#x3002;
&#x7B2C;&#x4E09;&#x9636;&#x6BB5;&#xFF0C;&#x89C9;&#x5F97;&#x72EC;&#x7ACB;&#x535A;&#x5BA2;&#x7684;&#x7BA1;&#x7406;&#x592A;&#x9EBB;&#x70E6;&#xFF0C;&#x6700;&#x597D;&#x5728;&#x4FDD;&#x7559;&#x63A7;&#x5236;&#x6743;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x8BA9;&#x522B;&#x4EBA;&#x6765;&#x7BA1;&#xFF0C;&#x81EA;&#x5DF1;&#x53EA;&#x8D1F;&#x8D23;&#x5199;&#x6587;&#x7AE0;&#x3002;</p>
</blockquote>
<p>&#x8FD9;3&#x4E2A;&#x9636;&#x6BB5;&#x7B97;&#x662F;&#x90FD;&#x8D9F;&#x8FC7;&#x4E86;&#xFF0C;&#x6700;&#x540E;&#x4EE5;&#x7B2C;&#x4E09;&#x9636;&#x6BB5;&#x9760;&#x9F50;&#x3002;&#x6709;&#x610F;&#x601D;&#x7684;&#x662F;&#x8F6C;&#x4E86;&#x4E00;&#x5708;&#xFF0C;&#x56DE;&#x5230;&#x539F;&#x70B9;&#xFF0C;&#x53EA;&#x662F;&#x6362;&#x4E86;&#x4E2A;&#x5E73;&#x53F0;&#x800C;&#x5DF2;&#xFF01;&#x8FD9;&#x4E5F;&#x7B97;&#x662F;&#x7B26;&#x5408;&#x4E00;&#x4E2A;&#x6807;&#x51C6;&#x7231;&#x6298;&#x817E;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x5199;&#x7167;&#xFF1A;</p>
<blockquote>
<p>&#x751F;&#x547D;&#x4E0D;&#x606F;&#xFF0C;&#x6298;&#x817E;&#x4E0D;&#x6B62;&#xFF01;</p>
</blockquote>
<p>&#x6210;&#x957F;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x95ED;&#x73AF;&#x3002;&#x4E0D;&#x662F;&#x95ED;&#x95E8;&#x9020;&#x8F66;&#x7684;&#x95ED;&#x73AF;&#xFF0C;&#x800C;&#x662F;&#x6D41;&#x52A8;&#x7684;&#x826F;&#x6027;&#x95ED;&#x73AF;&#x3002;&#x77E5;&#x8BC6;&#x95F4;&#x7684;&#x4F20;&#x9012;&#x3001;&#x4EA4;&#x6D41;&#xFF0C;&#x8F93;&#x51FA;--&gt;&#x53CD;&#x9988;&#x4EA4;&#x6D41;--&gt;&#x8F93;&#x5165;---&gt;&#x6C72;&#x53D6;---&gt;&#x8F93;&#x51FA;&#x3002;&#x4E0E;&#x4ED6;&#x4EBA;&#x5206;&#x4EAB;&#x4EA4;&#x6D41;&#x7684;&#x95ED;&#x73AF;&#x624D;&#x662F;&#x5FEB;&#x901F;&#x6210;&#x957F;&#x7684;&#x6700;&#x4F73;&#x201C;&#x6377;&#x5F84;&#x201D;&#xFF0C;&#x90A3;&#x4E9B;&#x5927;&#x5E08;&#x544A;&#x8BC9;&#x4F60;&#x7684;&#x5FEB;&#x901F;&#x6210;&#x529F;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x80FD;&#x975E;&#x6B67;&#x8DEF;&#xFF0C;&#x4F46;&#x5C0F;&#x5FC3;&#x4E2D;&#x95F4;&#x65AD;&#x5D16;&#xFF01;</p>
<p><strong>&#x6700;&#x540E;&#x5F15;&#x7528; <em>&#x77E5;&#x660E;&#x6240;&#x4EE5;</em> &#x535A;&#x5BA2;&#x7ED3;&#x5C3E;&#xFF1A;</strong></p>
<blockquote>
<p><a href="http://www.cnblogs.com/jhzhu/p/3893297.html" target="_blank">&#x8BA9;&#x81EA;&#x5DF1;&#x53D8;&#x5F97;&#x725B;&#x903C;, &#x8BA9;&#x522B;&#x4EBA;&#x77E5;&#x9053;&#x4F60;&#x725B;&#x903C;</a></p>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="2016-09-27-android应用自动化测试.html" class="navigation navigation-prev " aria-label="Previous page: 3.android应用自动化测试">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="2015-03-17-adb常用命令学习记录.html" class="navigation navigation-next " aria-label="Next page: 2.adb常用命令学习记录">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1.为何写博客","date":"2015-01-02T22:15:45.000Z","tags":["博客","随笔"],"categories":"随笔","level":"5.1","depth":1,"next":{"title":"2.adb常用命令学习记录","level":"5.2","depth":1,"path":"2015/2015-03-17-adb常用命令学习记录.md","ref":"2015/2015-03-17-adb常用命令学习记录.md","articles":[]},"previous":{"title":"3.android应用自动化测试","level":"4.3","depth":1,"path":"2015/2016-09-27-android应用自动化测试.md","ref":"2015/2016-09-27-android应用自动化测试.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"2015/2015-01-02-为何写博客.md","mtime":"2022-03-18T18:38:39.613Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-03-18T18:50:00.553Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

